# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.
# def user_data(**kwargs):
#     print(f"Ваши данные: {[i for i in kwargs.values()]}")
#
#
# print("Пожалуйста, введите свои данные.")
# user_data(name=input("Введите ваше имя.\n"),
#            surname=input("Введите вашу фамилию.\n"),
#            year=input("Введите год вашего рождения.\n"),
#            city=input("Введите город, в котором вы проживаете.\n"),
#            email=input("Введите адрес вашей электронной почты.\n"),
#            phone_number=input("Введите номер вашего телефона.\n"))


